twitter-app/app/controllers/tweets_controller.rb

SELECT "tweets".* FROM "tweets"
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT "tweets".* FROM "tweets" WHERE "tweets"."user_id" = ?  [["user_id", 1]]
---
	def index
		@tweets = Tweet.all

		@tweets_b_a = User.find(1).tweets

SELECT  "tweets".* FROM "tweets" WHERE "tweets"."id" = ? LIMIT 1  [["id", 1]]
---
	def edit
		@tweet = Tweet.find(params[:id])

SELECT  "tweets".* FROM "tweets" WHERE "tweets"."id" = ? LIMIT 1  [["id", 1]]
---
	def show
		@tweet = Tweet.find(params[:id])

INSERT INTO "tweets" ("message", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["message", "fasda"], ["user_id", 1], ["created_at", "2016-02-26 16:46:12.802125"], ["updated_at", "2016-02-26 16:46:12.802125"]]
---
	def create
		@tweet = Tweet.new(tweet_params)
		@tweet.save

SELECT  "tweets".* FROM "tweets" WHERE "tweets"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "tweets" SET "message" = ?, "updated_at" = ? WHERE "tweets"."id" = ?  [["message", "Mi Primer Tweet Editado"], ["updated_at", "2016-02-24 21:42:41.364103"], ["id", 1]]
---
	def update
		@tweet = Tweet.find(params[:id])
		@tweet.update(tweet_params)

SELECT  "tweets".* FROM "tweets" WHERE "tweets"."id" = ? LIMIT 1  [["id", 2]]
DELETE FROM "tweets" WHERE "tweets"."id" = ?  [["id", 2]]
---
	def destroy
		@tweet = Tweet.find(params[:id])
		@tweet.destroy