twitter-app/app/views/tweets/new.html.erb

	<p>
		<%= f.select :user_id, User.all.collect{|u| [u.nombre, u.id]} %>
---
SELECT  "users".* FROM "users"  ORDER BY "users"."id" ASC LIMIT 1